ahtn/keyplus/ports/efm8/efm8/mcu/C8051F912/inc/SI_C8051F912_Register_Enums.h
#define SPI1CFG_CKPHA__BMASK                0x20 ///< SPI1 Clock Phase                                  
#define SPI1CFG_CKPHA__SHIFT                0x05 ///< SPI1 Clock Phase                                  
#define SPI1CFG_CKPHA__DATA_CENTERED_FIRST  0x00 ///< Data centered on first edge of SCK period.        
#define SPI1CFG_CKPHA__DATA_CENTERED_SECOND 0x20 ///< Data centered on second edge of SCK period.       
                                                                                                        
#define SPI1CFG_MSTEN__BMASK                0x40 ///< Master Mode Enable                                
#define SPI1CFG_MSTEN__SHIFT                0x06 ///< Master Mode Enable                                
#define SPI1CFG_MSTEN__MASTER_DISABLED      0x00 ///< Disable master mode. Operate in slave mode.       
#define SPI1CFG_MSTEN__MASTER_ENABLED       0x40 ///< Enable master mode. Operate as a master.          
                                                                                                        
#define SPI1CFG_SPIBSY__BMASK               0x80 ///< SPI Busy                                          
#define SPI1CFG_SPIBSY__SHIFT               0x07 ///< SPI Busy                                          
#define SPI1CFG_SPIBSY__NOT_SET             0x00 ///< A SPI transfer is not in progress.                
#define SPI1CFG_SPIBSY__SET                 0x80 ///< A SPI transfer is in progress.                    
                                                                                                        
//------------------------------------------------------------------------------
// SPI1CKR Enums (SPI1 Clock Rate @ 0x85)
//------------------------------------------------------------------------------
#define SPI1CKR_SPI1CKR__FMASK 0xFF ///< SPI1 Clock Rate
#define SPI1CKR_SPI1CKR__SHIFT 0x00 ///< SPI1 Clock Rate
                                                        
//------------------------------------------------------------------------------
// SPI1CN Enums (SPI1 Control @ 0xB0)
//------------------------------------------------------------------------------
#define SPI1CN_SPIEN__BMASK                  0x01 ///< SPI1 Enable                                       
#define SPI1CN_SPIEN__SHIFT                  0x00 ///< SPI1 Enable                                       
#define SPI1CN_SPIEN__DISABLED               0x00 ///< Disable the SPI module.                           
#define SPI1CN_SPIEN__ENABLED                0x01 ///< Enable the SPI module.                            
                                                                                                         
#define SPI1CN_TXBMT__BMASK                  0x02 ///< Transmit Buffer Empty                             
#define SPI1CN_TXBMT__SHIFT                  0x01 ///< Transmit Buffer Empty                             
#define SPI1CN_TXBMT__NOT_SET                0x00 ///< The transmit buffer is not empty.                 
#define SPI1CN_TXBMT__SET                    0x02 ///< The transmit buffer is empty.                     
                                                                                                         
#define SPI1CN_NSSMD__FMASK                  0x0C ///< Slave Select Mode                                 
#define SPI1CN_NSSMD__SHIFT                  0x02 ///< Slave Select Mode                                 
#define SPI1CN_NSSMD__3_WIRE                 0x00 ///< 3-Wire Slave or 3-Wire Master Mode. NSS signal is 
                                                  ///< not routed to a port pin.                         
#define SPI1CN_NSSMD__4_WIRE_SLAVE           0x04 ///< 4-Wire Slave or Multi-Master Mode. NSS is an input
                                                  ///< to the device.                                    
#define SPI1CN_NSSMD__4_WIRE_MASTER_NSS_LOW  0x08 ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                  ///< logic low.                                        
#define SPI1CN_NSSMD__4_WIRE_MASTER_NSS_HIGH 0x0C ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                  ///< logic high.                                       
                                                                                                         
#define SPI1CN_RXOVRN__BMASK                 0x10 ///< Receive Overrun Flag                              
#define SPI1CN_RXOVRN__SHIFT                 0x04 ///< Receive Overrun Flag                              
#define SPI1CN_RXOVRN__NOT_SET               0x00 ///< A receive overrun did not occur.                  
#define SPI1CN_RXOVRN__SET                   0x10 ///< A receive overrun occurred.                       
                                                                                                         
#define SPI1CN_MODF__BMASK                   0x20 ///< Mode Fault Flag                                   
#define SPI1CN_MODF__SHIFT                   0x05 ///< Mode Fault Flag                                   
#define SPI1CN_MODF__NOT_SET                 0x00 ///< A master collision did not occur.                 
#define SPI1CN_MODF__SET                     0x20 ///< A master collision occurred.                      
                                                                                                         
#define SPI1CN_WCOL__BMASK                   0x40 ///< Write Collision Flag                              
#define SPI1CN_WCOL__SHIFT                   0x06 ///< Write Collision Flag                              
#define SPI1CN_WCOL__NOT_SET                 0x00 ///< A write collision did not occur.                  
#define SPI1CN_WCOL__SET                     0x40 ///< A write collision occurred.                       
                                                                                                         
#define SPI1CN_SPIF__BMASK                   0x80 ///< SPI1 Interrupt Flag                               
#define SPI1CN_SPIF__SHIFT                   0x07 ///< SPI1 Interrupt Flag                               
#define SPI1CN_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last  
                                                  ///< time SPIF was cleared.                            
#define SPI1CN_SPIF__SET                     0x80 ///< A data transfer completed.                        
                                                                                                         
//------------------------------------------------------------------------------
// SPI1DAT Enums (SPI1 Data @ 0x86)
//------------------------------------------------------------------------------
#define SPI1DAT_SPI1DAT__FMASK 0xFF ///< SPI1 Transmit and Receive Data
#define SPI1DAT_SPI1DAT__SHIFT 0x00 ///< SPI1 Transmit and Receive Data
                                                                       
//------------------------------------------------------------------------------
// TOFFH Enums (Temperature Sensor Offset High @ 0x86)
//------------------------------------------------------------------------------
#define TOFFH_TOFF__FMASK 0xFF ///< Temperature Sensor Offset High
#define TOFFH_TOFF__SHIFT 0x00 ///< Temperature Sensor Offset High
                                                                  
//------------------------------------------------------------------------------
// TOFFL Enums (Temperature Sensor Offset Low @ 0x85)
//------------------------------------------------------------------------------
#define TOFFL_TOFF__FMASK 0xC0 ///< Temperature Sensor Offset Low
#define TOFFL_TOFF__SHIFT 0x06 ///< Temperature Sensor Offset Low
                                                                 
//------------------------------------------------------------------------------
// TH0 Enums (Timer 0 High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define TH0_TH0__FMASK 0xFF ///< Timer 0 High Byte
#define TH0_TH0__SHIFT 0x00 ///< Timer 0 High Byte
                                                  
//------------------------------------------------------------------------------
// TH1 Enums (Timer 1 High Byte @ 0x8D)
//------------------------------------------------------------------------------
#define TH1_TH1__FMASK 0xFF ///< Timer 1 High Byte
#define TH1_TH1__SHIFT 0x00 ///< Timer 1 High Byte
                                                  
//------------------------------------------------------------------------------
// TL0 Enums (Timer 0 Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define TL0_TL0__FMASK 0xFF ///< Timer 0 Low Byte
#define TL0_TL0__SHIFT 0x00 ///< Timer 0 Low Byte
                                                 
//------------------------------------------------------------------------------
// TL1 Enums (Timer 1 Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define TL1_TL1__FMASK 0xFF ///< Timer 1 Low Byte
#define TL1_TL1__SHIFT 0x00 ///< Timer 1 Low Byte
                                                 
//------------------------------------------------------------------------------
// TMR2CN Enums (Timer 2 Control @ 0xC8)
//------------------------------------------------------------------------------
#define TMR2CN_T2XCLK__FMASK                  0x03 ///< Timer 2 External Clock Select                     
#define TMR2CN_T2XCLK__SHIFT                  0x00 ///< Timer 2 External Clock Select                     
#define TMR2CN_T2XCLK__SYSCLK_DIV_12_CAP_RTC  0x00 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                   ///< RTC/8.                                            
#define TMR2CN_T2XCLK__CMP_0_CAP_RTC          0x01 ///< External Clock is Comparator 0. Capture trigger is
                                                   ///< RTC/8.                                            
#define TMR2CN_T2XCLK__SYSCLK_DIV_12_CAP_CMP0 0x02 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                   ///< Comparator 0.                                     
#define TMR2CN_T2XCLK__RTC_DIV_8_CAP_CMP0     0x03 ///< External Clock is RTC/8. Capture trigger is       
                                                   ///< Comparator 0.                                     
                                                                                                          
