ahtn/keyplus/ports/efm8/efm8/mcu/C8051F912/inc/SI_C8051F912_Register_Enums.h
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__CLEARED_TO_0     0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET_TO_1         0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__CLEARED_TO_0     0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET_TO_1         0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// VDM0CN Enums (VDD/DC+ Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VBATOKIE__BMASK             0x04 ///< VBAT Early Warning Interrupt Enable          
#define VDM0CN_VBATOKIE__SHIFT             0x02 ///< VBAT Early Warning Interrupt Enable          
#define VDM0CN_VBATOKIE__DISABLED          0x00 ///< Disable the VBAT Early Warning interrupt.    
#define VDM0CN_VBATOKIE__ENABLED           0x04 ///< Enable the VBAT Early Warning interrupt.     
                                                                                                  
#define VDM0CN_VDDOKIE__BMASK              0x08 ///< VDD/DC+ Early Warning Interrupt Enable       
#define VDM0CN_VDDOKIE__SHIFT              0x03 ///< VDD/DC+ Early Warning Interrupt Enable       
#define VDM0CN_VDDOKIE__DISABLED           0x00 ///< Disable the VDD/DC+ Early Warning interrupt. 
#define VDM0CN_VDDOKIE__ENABLED            0x08 ///< Enable the VDD/DC+ Early Warning interrupt.  
                                                                                                  
#define VDM0CN_VBATOK__BMASK               0x10 ///< VBAT Supply Status (Early Warning)           
#define VDM0CN_VBATOK__SHIFT               0x04 ///< VBAT Supply Status (Early Warning)           
#define VDM0CN_VBATOK__VBAT_BELOW_VBATWARN 0x00 ///< VBAT is at or below the VBATWARN threshold.  
#define VDM0CN_VBATOK__VBAT_ABOVE_VBATWARN 0x10 ///< VBAT is above the VBATWARN threshold.        
                                                                                                  
#define VDM0CN_VDDOK__BMASK                0x20 ///< VDD/DC+ Supply Status (Early Warning)        
#define VDM0CN_VDDOK__SHIFT                0x05 ///< VDD/DC+ Supply Status (Early Warning)        
#define VDM0CN_VDDOK__VDD_BELOW_VDDWARN    0x00 ///< VDD/DC+ is at or below the VDDWARN threshold.
#define VDM0CN_VDDOK__VDD_ABOVE_VDDWARN    0x20 ///< VDD/DC+ is above the VDDWARN threshold.      
                                                                                                  
#define VDM0CN_VDDSTAT__BMASK              0x40 ///< VDD/DC+ Supply Status                        
#define VDM0CN_VDDSTAT__SHIFT              0x06 ///< VDD/DC+ Supply Status                        
#define VDM0CN_VDDSTAT__VDD_BELOW_VRST     0x00 ///< VDD/DC+ is at or below the VRST threshold.   
#define VDM0CN_VDDSTAT__VDD_ABOVE_VRST     0x40 ///< VDD/DC+ is above the VRST threshold.         
                                                                                                  
#define VDM0CN_VDMEN__BMASK                0x80 ///< VDD/DC+ Supply Monitor Enable                
#define VDM0CN_VDMEN__SHIFT                0x07 ///< VDD/DC+ Supply Monitor Enable                
#define VDM0CN_VDMEN__DISABLED             0x00 ///< Disable the VDD/DC+ Supply Monitor.          
#define VDM0CN_VDMEN__ENABLED              0x80 ///< Enable the VDD/DC+ Supply Monitor.           
                                                                                                  
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_REFOE__BMASK           0x01 ///< Internal Voltage Reference Output Enable         
#define REF0CN_REFOE__SHIFT           0x00 ///< Internal Voltage Reference Output Enable         
#define REF0CN_REFOE__DISABLED        0x00 ///< Internal 1.68 V Precision Voltage Reference      
                                           ///< disabled and not connected to P0.0/VREF.         
#define REF0CN_REFOE__ENABLED         0x01 ///< Internal 1.68 V Precision Voltage Reference      
                                           ///< enabled and connected to P0.0/VREF.              
                                                                                                 
#define REF0CN_TEMPE__BMASK           0x04 ///< Temperature Sensor Enable                        
#define REF0CN_TEMPE__SHIFT           0x02 ///< Temperature Sensor Enable                        
#define REF0CN_TEMPE__TEMP_DISABLED   0x00 ///< Disable the Temperature Sensor.                  
#define REF0CN_TEMPE__TEMP_ENABLED    0x04 ///< Enable the Temperature Sensor.                   
                                                                                                 
#define REF0CN_REFSL__FMASK           0x18 ///< Voltage Reference Select                         
#define REF0CN_REFSL__SHIFT           0x03 ///< Voltage Reference Select                         
#define REF0CN_REFSL__VREF_PIN        0x00 ///< The ADC0 voltage reference is the P0.0/VREF pin. 
#define REF0CN_REFSL__VDD_PIN         0x08 ///< The ADC0 voltage reference is the VDD/DC+ pin.   
#define REF0CN_REFSL__INTERNAL_LDO    0x10 ///< The ADC0 voltage reference is the internal 1.8 V 
                                           ///< digital supply voltage.                          
#define REF0CN_REFSL__HIGH_SPEED_VREF 0x18 ///< The ADC0 voltage reference is the internal 1.65 V
                                           ///< high speed voltage reference.                    
                                                                                                 
#define REF0CN_REFGND__BMASK          0x20 ///< Analog Ground Reference                          
#define REF0CN_REFGND__SHIFT          0x05 ///< Analog Ground Reference                          
#define REF0CN_REFGND__GND_PIN        0x00 ///< The ADC0 ground reference is the GND pin.        
#define REF0CN_REFGND__AGND_PIN       0x20 ///< The ADC0 ground reference is the P0.1/AGND pin.  
                                                                                                 
//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_OSCBIAS__BMASK              0x10 ///< High Frequency Oscillator Bias                    
#define REG0CN_OSCBIAS__SHIFT              0x04 ///< High Frequency Oscillator Bias                    
#define REG0CN_OSCBIAS__ENABLE_WHEN_NEEDED 0x00 ///< Allow the hardware to enable the precision High   
                                                ///< Frequency Oscillator bias whenever its needed.    
#define REG0CN_OSCBIAS__FORCE_ENABLED      0x10 ///< Force the precision High Frequency Oscillator bias
                                                ///< on.                                               
                                                                                                       
//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xAA)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__BMASK 0x01 ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select
                                                      
#endif // SI_C8051F912_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

